from tts_arabic import tts
import sounddevice as sd

text = """
مَا يَبْتَلِي الإِنْسَانُ إِلَّا بِسَبَبِ ذَنْبٍ، وَمَا يَرْفَعُ إِلَّا بِتَوْبَةٍ. فَأَ حْيَانًا الإِنْسَانُ،
كَثِيرٌ مِنَ النَّاسِ الْآنِ، عِنْدَمَا يُبْتَلَى لَا يَفْكَرُ فِي هَذَا الْأَمْرِ. يَعْنِي بَعْضُ النَّاسِ الْآنَ
يَبْتَلَى بِوُضُوحٍ. تَبَّيْحٌ، أَوَّلُ خُطْوَةٍ، أَوَّلُ خُطْوَةٍ: إسْأَلْ
"""
wave = tts(text, speaker=1, pace=1.0, play=True)

text_unvoc = """
ما يبتلى الانسان الا بسبب ذنب، وما يرفع الا بتوبة. فأحيانًا الانسان، كثير من الناس الان، عندما يبتلى لا يفكر في هذا الامر. يعني بعض الناس الان يبتلى بوضوح. طيب، اول خطوة، اول خطوة: اسأل لماذا؟ قد تكون انت مقصرًا، انتِ مقصرة في فرض من فرائض الله، في ذنب من الذنوب. مثلا الانسان يراجع نفسه، يحاسب نفسه. الشيء الاخر، اخر: الحمد لله الذي
"""
wave = tts(text_unvoc, play=True, vowelizer='shakkelha')